# FBXExportOptions Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
FBXExportOptions Class
Members See Also
---
3D-Studio Max (FBX) Export options.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class FBXExportOptions
```

Visual Basic
---
```text
Public Class FBXExportOptions
```

Visual C++
---
```text
public ref class FBXExportOptions
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..FBXExportOptions
# See Also
FBXExportOptions Members
Autodesk.Revit.DB Namespace